app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "hossam"], ["last_name", "sherif"], ["created_at", "2015-04-08 15:44:07.411545"], ["updated_at", "2015-04-08 15:44:07.411545"]]
---
    def create
      @user = User.new(user_params)
      @user.save